{
    "posts": [
        {
            "banner": "img/Rise-of-The-Blog.png",
            "date": "21/10/2021",
            "topic": "development",
            "title": "Rise of The Blog",
            "description": "Here you can read about why and how this blog came to exist.",
            "images": [
                "img/CCCP.jpg"
            ],
            "content": [
                "<p>Me, writing this post, means that I've made it in the third and final year of my bachelor education at Howest. What a road it has been! Each of my semesters consisted out of diverse courses, labs and projects of which this blog / portfolio is one.</p>",
                "<p>For the course <em>Professional Networking</em> we received the assignment to attend multiple events that have to do with the education and write our findings down in a selfmade blog in a professional manner. So here it is!</p>",
                "<p>Setting up this project, I wanted to have as much control as possible and use my acquired skills in web development and server management to the fullest. So I decided to use an on-premise web server and do all configuration on my own.</p>",
                "<p>All went smooth. Downloading and installing the necessary software, figuring out all configurations and of course, making the whole system as secure as possible. Before I knew it, I had the thing up and running locally. Next up, making sure that my visitors and I have access from all around the globe. Shouldn't be much of a deal right? Just create some port forwards and we're good to go. Unfortunately, I was wrong.</p>",
                "<p>Forwarding for my SSH connection and a Minecraft server I had running were working fine, but for some reason, I just couldn't get ports 80 and 443 to open which are required to access my website. And so I began the debugging process. After a lot of head scratching, testing different ports, messing with configurations and blaming my precious server, I finally reached out to the helpdesk and forum of my ISP. The helpdesk had no clue what I was talking about ofcourse but the forum gave a clue about a setting in the mobile app of the ISP in which you can make some minor configurations of your devices.</p>",
                "<p>I reached out to my mom, searched her client ID of the provider and made her an account for the app. There it finally was! A button to configure the \"security\" of my router. High security meant that ports 80, 443 and 445 were impossible to open... I placed it on low security and a reboot later I could access my website from the internet. Sigh..</p>",
                "<p>Don't get me wrong. I appreciate that my ISP does its best to secure its devices and protect its clients and they do a good job at that compared to other cases I've encountered but I think that anyone who finds theirselves in the port forwarding settings, opening port 80 and/or 443, knows what they are doing. I could be severely wrong about that but at least the helpdesk should have a clue about the existence of this option. ISPs am I right?</p>",
                "<p>And so I could start creating the layout of my portfolio, writing my blog posts and share my experiences with you! Feel free to check out my <a href='https://github.com/MartienskieNum1' target='_blank'>GitHub</a> account too where also the source code of this portfolio can be found ;)</p>"
            ]
        },
        {
            "banner": "img/Cyber-Security-Challenge.png",
            "date": "02/11/2021",
            "topic": "hackathon",
            "title": "Cyber Security Challenge 2020",
            "description": "My first ever hackathon and Capture The Flag challenge!",
            "images": [
                "img/lots-of-food.jpg"
            ],
            "content": [
                "<p>As my first extracurricular IT event, I participated in the Cyber Security Challenge of Belgium. A Capture The Flag based hackathon that is organised each year in March in which students can participate in teams of maximum four. During this challenge, the students need to find solutions for \"puzzles\" in a wide range of topics like cryptography, reverse engineering, network security, web or mobile application security, steganography, wireless and forensics analysis.</p>",
                "<p>Being my first hackathon, I was pretty nervous and didn't know what to expect, and whether it was worth skipping a few lessons since I had only just begun my education. Fortunately, I had a bunch of good friends by my side with whom a good time was guaranteed!</p>",
                "<p>We had to prepare ourselves for the all-nighter we were about to commit, so we stocked up on drinks, snacks and some banging playlists to survive the night. And so it began, from the beginning until the end, we did research, scanned networks, gazed upon code, images and soundwave forms, put our heads together for hours on end to score as high as possible in the leaderboard.</p>",
                "<p>Despite our best efforts, Vulpes, our group, ended in the 124th place out of the 204 who participated. However, it didn't feel like a defeat! We were more than satisfied with how far we had come and the newly gathered knowledge. We were hyped to participate again next year to apply our now more superior hacking experience!</p>"
            ]
        },
        {
            "banner": "img/Cyber-Security-Challenge.png",
            "date": "29/11/2021",
            "topic": "hackathon",
            "title": "Cyber Security Challenge 2021",
            "description": "A new take on the CSC. No more groping in the dark... (or at least less)",
            "images": [],
            "content": [
                "<p>Coming into my second Cyber Security Challenge, I had a whole different feeling about this years edition. I was less stressed, because I did know what kind of challenges and puzzles to expect, covering which topics and probably because this time I knew that it was totally worth my time and sleep. The only thing I felt on my mind was that I was curious to know how big an impact my first year of IT experience, education and projects would have on my ability to solve these challenges and on our end result.</p>",
                "<p>We had a good start. We were finding flags at a good pace and wriggled our way up the leaderboard. At one point, at the end of the first day when we suddenly got a lot of flags, we even got into the top 10! This was an enormous morale boost to keep it up and we saw a chance to get into the next round. However, there was still a lot of time left. We decided, on this high, to get a bit of sleep.</p>",
                "<p>After two hours or so, we got back to work. We checked our placement and saw that we were kicked out of the top 10 but not by much. We eagerly got back to finding those precious flags expecting that we would be back in the run in no time. How we were wrong... The second \"day\", we only found one flag. Slowly but surely, our placement sank down, but not our perseverance!</p>",
                "<p>We kept looking and looking but with no results. At the end, we became somewhat desperate and thus we began solving puzzles manually which were supposed to be solved by scripting. Like manually noting down 1s and 0s based on long and short beeps in a wav file in an attempt to create a png file. We got to half of it but ran out of time. I still think that if we would've done the other half, we would've found it!</p>",
                "<p>And so the CSC came to an end. Our group, the Byte Busters, was placed 71st out of the 171 participating. Somewhat dissapointed that we couldn't make it in the second round but very proud of our improved result in comparison with past year. We'll be back next year!</p>"
            ]
        }
    ]
}